<a href="https://colab.research.google.com/github/WPSYG/Python-2-day-workshop/blob/master/Part_05_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<a href="https://colab.research.google.com/github/WPSYG/Python-2-day-workshop/blob/master/Part_05_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<img src="https://raw.githubusercontent.com/WPSYG/Python-2-day-workshop/master/images/logo_color_v1.jpeg?token=AIW35UC2GIMYQ4MY6FNWFCC7HQ5SQ">

# PANDAS

Pandas are a high-dimensional data manipulation tool. They are built on the Numpy package implying that much of the numpy structures is replicated in pandas. The basic key sructure of pandas is the dataframe. A dataframe allows store and manipulate tabular data in rows (observations) and columns (variables). 

Data in pandas is often used to feed statistical analysis in **Scipy**,  plotting functions from **matplotlib** and machine learning algorithms from **sci-learn**. This makes pandas one of the most favourite data science tool for data wrangling and analysis. It is a game changer when it comes to data cleaning, transformation, manipulation and data analysis. 

To better understand how pandas work, we will cover the following areas;

1.   Introduction to pandas
2.   Pandas data structures
3.   Indexing and selecting data
4.   Reading data into pandas
5.   Basic operations on data
  

## Panda data structures

Pandas deal with the following data structures


1.   **Series** - This is an one dimensional array like structure with homogenous data.


2. **Dataframes**- This is a two-dimensional heterogenous tabular data structure with rows and columns.

3. **Panel**-   Three dimesional data structure with heterogeneous data

**Creating a series**

We can create a series by using a list, array or dictionary. Let get started by creating an empty series.

In [ ]:
#Import pandas library
import pandas as pd

# Creating empty series  
Emptyseries = pd.Series()
print(Emptyseries)

Series([], dtype: float64)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """

1. Creating a series using a list

In [ ]:
#create a series using a list  
lst =[2,3,5,7,8] 
    
series_list = pd.Series(lst)  
print(series_list)

0    2
1    3
2    5
3    7
4    8
dtype: int64

2. Creating a series using an array

In [ ]:
# simple array  
data = np.array(['Women', 'Promoting', 'Science', 'to', 'the','Young','Generation'])  
    
ser = pd.Series(data)  
print(ser)

0         Women
1     Promoting
2       Science
3            to
4           the
5         Young
6    Generation
dtype: object

3. Using a dictionary

We can use the examples above to work out how to use dictionaries to create a series

## Creating a data frame

Dataframes can be created in different ways. As in the case of series, we can use lists, arrays and dictionaries to create dataframes. 

Let us start by creating an empty dataframe. We use the dataframe constructor **pd.dataframe()** as shown below

In [ ]:
#Creating an empty data frame
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

1. Creating dataframes using lists

In [ ]:
# creating a list 
lst = [10, 15,45, 2, 1]  
   
# Calling DataFrame constructor on list  
df = pd.DataFrame(lst)  
print(df)

    0
0  10
1  15
2  45
3   2
4   1

We can add a column name to the dataframe by specifying the name inside the dataframe constructor

In [ ]:
df = pd.DataFrame(lst,columns=["Marks"])  
df

   Marks
0     10
1     15
2     45
3      2
4      1

2. Creating a dataframe using dictionaries

In [ ]:
# DataFrame from dict narray

# intialise data of lists.
data = {'Name':['Mary', 'Susan', 'Sarah', 'Hellen'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame using the constructo
df = pd.DataFrame(data)
 
# Print the dataframe.
print(df)

     Name  Age
0    Mary   20
1   Susan   21
2   Sarah   19
3  Hellen   18

We can also try to check out how we can create dataframes using other methods. 

Now let us see how we can deal with the rows and columns of a dataframe

# Dealing with rows and columns
We can perform basic operations on rows/columns like selecting, deleting, adding, and renaming values in the dataframe. Let us create a dataframe to illustrate this.

In [ ]:
#Import numpy to help create null values
import numpy as np
# Define a dictionary containing employee data
data = {'Name':['Mary', 'Susan', "Sarah", 'Hellen'],
        'Age':[27, np.NaN, 22, 32],
        'Country':['SA', 'KE', 'GH', 'TZ'],
        'Qualification':['Msc', 'MA', 'MA', 'Phd']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
#View the entire data frame
#print(df)
df

     Name   Age Country Qualification
0    Mary  27.0      SA           Msc
1   Susan   NaN      KE            MA
2   Sarah  22.0      GH            MA
3  Hellen  32.0      TZ           Phd

### Selecting

1. Column Selection: 

In order to select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name. We simply put the name of the column in-between the brackets

In [ ]:
 # select a single column
df["Name"]

0      Mary
1     Susan
2     Sarah
3    Hellen
Name: Name, dtype: object

To return the column name, using double square brackets

In [ ]:
df[["Name"]]

     Name
0    Mary
1   Susan
2   Sarah
3  Hellen

We can select more than one column

In [ ]:
# select more than one column
print(df[['Name', 'Country',"Qualification"]])

     Name Country Qualification
0    Mary      SA           Msc
1   Susan      KE            MA
2   Sarah      GH            MA
3  Hellen      TZ           Phd

2. Row Selection: 

Pandas provide a unique method to retrieve rows from a data frame.The  **.loc[ ]**  method is used to retrieve rows from Pandas dataframe. This is done passing integer location to the **loc[ ]** function of specifying the column name and specific condition to be met

In [ ]:
#Specifying the index of the row
df.loc[[1]]

    Name  Age Country Qualification
1  Susan  NaN      KE            MA

In [ ]:
# retrieving row by loc method using a condition
df.loc[df['Name'] == 'Mary']

   Name   Age Country Qualification
0  Mary  27.0      SA           Msc

The second logic is to use **.iloc** to select rows and columns by their indexes

In [ ]:
df.iloc[0:2,0:2]

    Name   Age
0   Mary  27.0
1  Susan   NaN

### Renaming
We can rename columns in a dataframe

In [ ]:
df.rename(columns={'Name':'S'})
df

     Name   Age Country Qualification
0    Mary  27.0      SA           Msc
1   Susan   NaN      KE            MA
2   Sarah  22.0      GH            MA
3  Hellen  32.0      TZ           Phd

In [ ]:
#Renaming all columns
df.columns=["Names","Old","Origin","Qual"]
df

    Names   Old Origin Qual
0    Mary  27.0     SA  Msc
1   Susan   NaN     KE   MA
2   Sarah  22.0     GH   MA
3  Hellen  32.0     TZ  Phd

# Missing Values
To check for missing values in the dataframe, we use the using **isnull()** function

In [ ]:
df.isnull()

   Names    Old  Origin   Qual
0  False  False   False  False
1  False   True   False  False
2  False  False   False  False
3  False  False   False  False

We can check the total number of missing values in the dataframe by summing all the missing values

In [ ]:
df.isnull().sum()

Name             0
Age              1
Country          0
Qualification    0
dtype: int64

We can replace the missing values with a different value using using **fillna( )**

In [ ]:
completedf=df.fillna(0)
completedf

     Name   Age Country Qualification
0    Mary  27.0      SA           Msc
1   Susan   0.0      KE            MA
2   Sarah  22.0      GH            MA
3  Hellen  32.0      TZ           Phd

In [ ]:
#Check whether it has replaced
completedf.isnull().sum()

Name             0
Age              0
Country          0
Qualification    0
dtype: int64

We can also drop the columns or rows that has missing values. We specify axis(0) for rows and axis(1) for columns

In [ ]:
df.dropna(axis=0)

     Name   Age Country Qualification
0    Mary  27.0      SA           Msc
2   Sarah  22.0      GH            MA
3  Hellen  32.0      TZ           Phd

In [ ]:
#Drop column with na
df.dropna(axis=1)

     Name Country Qualification
0    Mary      SA           Msc
1   Susan      KE            MA
2   Sarah      GH            MA
3  Hellen      TZ           Phd

#Reading data into pandas

There are various file formats that pandas can read.  In this tutorial we will focus on csv file format. We will look at the various operations using sample dataset that will provided.

We can import data using the read command as follows

In [4]:
# Load the Pandas libraries with alias 'pd' 
import pandas as pd
# Read data from file 'filename.csv' depending on the file extension 
dataset = pd.read_csv("https://raw.githubusercontent.com/WPSYG/Python-2-day-workshop/master/data/sales.csv")
#dataset #displays the whole dataset

We can decide to view the first few rows of the data or the last few rows using the head or tail command

In [3]:
# Preview the first 5 lines of the loaded data 
dataset.head()

  Transaction_date   Product Price  ...    Last_Login   Latitude   Longitude
0      1/2/09 6:17  Product1  1200  ...   1/2/09 6:08  51.500000   -1.116667
1      1/2/09 4:53  Product1  1200  ...   1/2/09 7:49  39.195000  -94.681940
2     1/2/09 13:08  Product1  1200  ...  1/3/09 12:32  46.188060 -123.830000
3     1/3/09 14:44  Product1  1200  ...  1/3/09 14:22 -36.133333  144.750000
4     1/4/09 12:56  Product2  3600  ...  1/4/09 12:45  33.520560  -86.802500

[5 rows x 12 columns]

In [ ]:
# Preview the first 5 lines of the loaded data 
#dataset.tail()

In [5]:
#We specify the number of rows we need to display
dataset.head(2)

  Transaction_date   Product Price  ...   Last_Login Latitude  Longitude
0      1/2/09 6:17  Product1  1200  ...  1/2/09 6:08   51.500  -1.116667
1      1/2/09 4:53  Product1  1200  ...  1/2/09 7:49   39.195 -94.681940

[2 rows x 12 columns]

**Checking the shape, size and dimension of the data**

In [6]:
#Shape of the data-gives total rows and columns
dataset.shape

(998, 12)

In [7]:
#The total number of elements in the dataset-gives rows x columns
dataset.size

11976

In [8]:
#Dimension
dataset.ndim

2

In [9]:
###  unique values in categorical variables
unique = dataset.select_dtypes('object').apply(pd.Series.nunique, axis = 0)
unique

Transaction_date    987
Product               4
Price                 9
Payment_Type          4
Name                765
City                759
State               204
Country              56
Account_Created     976
Last_Login          977
dtype: int64

# Indexing and subsetting

1. Using loc function. 

The loc indexer is used with the same syntax as iloc: data.loc[row selection, column selection]. It can be done in two ways

         a.) Selecting rows by label/index

In [10]:
#Set an index for the data
dataset.set_index("Transaction_date", inplace=False)
#Specify the rows you want to return by their indexes
dataset.loc[0:3]

  Transaction_date   Product Price  ...    Last_Login   Latitude   Longitude
0      1/2/09 6:17  Product1  1200  ...   1/2/09 6:08  51.500000   -1.116667
1      1/2/09 4:53  Product1  1200  ...   1/2/09 7:49  39.195000  -94.681940
2     1/2/09 13:08  Product1  1200  ...  1/3/09 12:32  46.188060 -123.830000
3     1/3/09 14:44  Product1  1200  ...  1/3/09 14:22 -36.133333  144.750000

[4 rows x 12 columns]

2.  Using iloc function

The iloc indexer syntax is data.iloc[row selection, column selection]. **“iloc”** in pandas is used to select rows and columns by number, in the order that they appear in the data frame.

In [11]:
dataset.iloc[0:2,1:3]

    Product Price
0  Product1  1200
1  Product1  1200

3. Using ix and iloc function. 

The ix\[ \] indexer is a hybrid of **.loc** and **.iloc.**  Find time and check out this type of indexing.

**Checking for missing values in our dataset**

In [12]:
#Checking the total number of missing values 
dataset.isna().sum()

Transaction_date    0
Product             0
Price               0
Payment_Type        0
Name                0
City                0
State               1
Country             0
Account_Created     0
Last_Login          0
Latitude            0
Longitude           0
dtype: int64

Filling in the missing values in the dataset

In [13]:
#Fill missing values using the forward method
new_data=dataset.fillna(axis=1, method="ffill")
#new_data
#We can now check whether we have missing values
new_data.isnull().sum()

Transaction_date    0
Product             0
Price               0
Payment_Type        0
Name                0
City                0
State               0
Country             0
Account_Created     0
Last_Login          0
Latitude            0
Longitude           0
dtype: int64

Get an overview of the data using the **describe** function

In [14]:
new_data.describe(include="all")

       Transaction_date   Product Price  ...    Last_Login   Latitude  Longitude
count               998       998   998  ...           998  998.00000  998.00000
unique              987         4     9  ...           977  706.00000  723.00000
top        1/7/09 13:28  Product1  1200  ...  2/26/09 7:32   51.52721    0.14559
freq                  2       847   841  ...             3   14.00000   14.00000

[4 rows x 12 columns]

Get the number of data types you are using

In [15]:
dataset.dtypes.value_counts()

object     10
float64     2
dtype: int64

Get the list of the columns in the dataset

In [16]:
dataset.columns.tolist()

['Transaction_date',
 'Product',
 'Price',
 'Payment_Type',
 'Name',
 'City',
 'State',
 'Country',
 'Account_Created',
 'Last_Login',
 'Latitude',
 'Longitude']

# Exercise
1. Create a dataframe with the following exam details: 

exam_data = {'name': ['Mary', 'Tim', 'Kate', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Susan', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']

**Questions**
1. Create a dataframe from the above given data

In [ ]:
# Write your solution here :)

Double-click _here_ for the solution.

<!-- Your answer is below:
import pandas as pd
import numpy as np

exam_data  = {'Name': ['Mary', 'Tim', 'Kate', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Susan', 'Jonas'],
        'Score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'Attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'Qualified': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']

Data_Ex = pd.DataFrame(exam_data , index=labels)
print(Data_Ex)
-->

2. Find the summary scores of the students

In [ ]:
# Write your solution here :)

Double-click _here_ for the solution.

<!-- Your answer is below:
Data_Ex["Score"].describe()
-->

3. How many missing values are there in the dataframe? Which variables have missing values?

In [ ]:
# Write your solution here :)

Double-click _here_ for the solution.

<!-- Your answer is below:
Data_Ex.isna().sum()
-->

4. Replace the missing values with the mean

In [ ]:
# Write your solution here :)

Double-click _here_ for the solution.

<!-- Your answer is below:
Data_Ex1=Data_Ex.fillna(np.mean(Data_Ex["Score"]))
Data_Ex1
-->

5. Give a list of the students who Qualified

In [ ]:
# Write your solution here :)

Double-click _here_ for the solution.

<!-- Your answer is below:
Qualified=Data_Ex[Data_Ex["Qualified"]=='yes']
Qualified
-->

6. Rank the students from the one with the highest to the lowest score

In [ ]:
# Write your solution here :)

Double-click _here_ for the solution.

<!-- Your answer is below:
Data_Ex1["Rank"]=Data_Ex1["Score"].rank()
Data_Ex1
-->

___
**Course Content Creators**: [Sokhar Samb](https://twitter.com/SambSokhar), [Foutse Yuehgoh](https://twitter.com/yuehgoh), [Deborah D Kanubala](https://www.linkedin.com/in/ddk2018/), Faith Benson, Salomey Osei, Yolande Ngueabou, Deo Byabazaire, Bernard Osei, [Elkanah Nyabuto](https://www.linkedin.com/in/elkanahnyabuto/).




**Course Reviewer:** [Salomon Kabongo](https://twitter.com/SalomonKabongo1)